app/views/category_taggings/new.html.erb

      <div class="form-group">
        <%= f.input :taggable_id,
                    as: :select,
                    required: true,
                    collection: Product.all,
                    input_html: { class: "form-control"} %>
---
SELECT "products".* FROM "products"