app/views/user_collections/show.html.erb

    <tbody>
    <% @collection.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "collection_items" ON "products"."id" = "collection_items"."product_id" WHERE "collection_items"."collection_id" = ?  [["collection_id", 8]]

          <td>
            <%= link_to("Delete", collection_collection_item_path(@collection, CollectionItem.find_by(collection_id: @collection.id, product_id: product.id)), class: "btn btn-sm btn-default", method: :delete, data: { confirm: "Are you sure?" } )%>
---
SELECT  "collection_items".* FROM "collection_items" WHERE "collection_items"."collection_id" = ? AND "collection_items"."product_id" = ? LIMIT 1  [["collection_id", 8], ["product_id", 5]]