app/controllers/category_products_controller.rb

SELECT  "products".* FROM "products" WHERE (EXISTS (SELECT 1 FROM taggings produ_catego_taggings_c30e4f2 WHERE produ_catego_taggings_c30e4f2.taggable_id = products.id AND produ_catego_taggings_c30e4f2.taggable_type = 'Product' AND produ_catego_taggings_c30e4f2.context = 'categorys' AND produ_catego_taggings_c30e4f2.tag_id in (6))) AND "products"."id" = ?  ORDER BY "products"."updated_at" ASC LIMIT 1  [["id", 2]]
---
  def show
    @product = Product.by_category(@tag.name).find( params[:id] )

INSERT INTO "products" ("title", "image", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "M8"], ["image", "images_templerun.jpeg"], ["description", "asasa"], ["user_id", 1], ["created_at", "2015-08-08 10:02:41.466115"], ["updated_at", "2015-08-08 10:02:41.466115"]]
---
  def create
    @product = @user.products.build( product_params )
    unless permitted(@product)
      redirect_to products_path( @user )
      return
    end
    if @product.save && @product.update_category(params[:product][:category_ids])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @product = Product.find( params[:id] )

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "2013_cat_black_white_jellicle.jpg"], ["updated_at", "2015-09-07 06:28:23.471814"], ["id", 4]]
---
  def update
    @product = Product.find( params[:id] )
    unless permitted(@product)
      redirect_to products_path( @user )
      return
    end
    if @product.update( product_params ) && @product.update_category(params[:product][:category_ids])

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product = Product.find( params[:id] )
    unless permitted(@product)
      redirect_to products_path( @user )
      return
    end
    if @product.nil?
      Rails.logger.debug ("product is NULL")
    else
      @product.destroy

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('htc') OR LOWER(name) = LOWER('apple'))
---
  def find_category
    @tag = Tag.find( params[:tag_id] )