app/controllers/categorys_controller.rb

  def show
    @category = Product.tag_counts_on(:categorys).find( params[:id] )
---
SELECT  tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN products ON products.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Product' AND taggings.context = 'categorys') AND (taggings.taggable_id IN(SELECT products.id FROM "products")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE "tags"."id" = ? LIMIT 1  [["id", 5]]
SELECT "products".* FROM "products" WHERE (EXISTS (SELECT 1 FROM taggings produ_catego_taggings_c30e4f2 WHERE produ_catego_taggings_c30e4f2.taggable_id = products.id AND produ_catego_taggings_c30e4f2.taggable_type = 'Product' AND produ_catego_taggings_c30e4f2.context = 'categorys' AND produ_catego_taggings_c30e4f2.tag_id in (5)))  ORDER BY "products"."updated_at" ASC

  def create
    @category = Tag.new( tag_params )
    unless permitted(@category)
      redirect_to tags_path
      return
    end
    if @category.save
---
INSERT INTO "tags" ("name") VALUES (?)  [["name", "hTC"]]

  def edit
    @category = Product.tag_counts_on(:categorys).find( params[:id] )
---
SELECT  tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN products ON products.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Product' AND taggings.context = 'categorys') AND (taggings.taggable_id IN(SELECT products.id FROM "products")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @category = Product.tag_counts_on(:categorys).find( params[:id] )
    unless permitted(@category)
      redirect_to tags_path
      return
    end

    if @category.update( tag_params )
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tags" SET "name" = ? WHERE "tags"."id" = ?  [["name", "hTC1"], ["id", 1]]

  def destroy
    @category = Product.tag_counts_on(:categorys).find( params[:id] )
    unless permitted(@category)
      redirect_to tags_path
      return
    end
    if @category.nil?
      Rails.logger.debug ("product is NULL")
    else
      @category.destroy
---
SELECT  tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN products ON products.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Product' AND taggings.context = 'categorys') AND (taggings.taggable_id IN(SELECT products.id FROM "products")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]