app/controllers/category_taggings_controller.rb

INSERT INTO "taggings" ("taggable_id", "taggable_type", "context", "tag_id", "created_at") VALUES (?, ?, ?, ?, ?)  [["taggable_id", 1], ["taggable_type", "Product"], ["context", "categorys"], ["tag_id", 4], ["created_at", "2015-08-08 09:11:55.415789"]]
---
  def create
    flash[:notice] = "at least add one product to the tag"
    params = tagging_params
    params[:taggable_type] = "Product"
    params[:context] = "categorys"
    @tagging = @tag.taggings.build( params )
    unless permitted(@tagging)
      redirect_to tags_path
      return
    end
    if @tagging.save

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]
---
  def find_category
    @tag = Tag.find( params[:tag_id] )