app/controllers/collection_items_controller.rb

  def destroy
    binding.pry
    @collection = CollectionItem.find_by(id: params[:id])
    unless permitted(@collection)
      redirect_to collections_path
      return
    end
    @collection.destroy
---
SELECT  "collection_items".* FROM "collection_items" WHERE "collection_items"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "collection_items" WHERE "collection_items"."id" = ?  [["id", 1]]