app/controllers/main_pages_controller.rb

  def index
    flash[:notice] = "this is main products page"
#TODO: need to pass the proper items to main pages by this action, EX top10 products
    @products = Product.all
---
SELECT "products".* FROM "products"