app/controllers/product_posts_controller.rb

INSERT INTO "posts" ("title", "description", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dsdas"], ["description", "asdasd"], ["product_id", 1], ["created_at", "2015-08-08 06:51:04.805114"], ["updated_at", "2015-08-08 06:51:04.805114"]]
---
  def create
    @post = @product.posts.build( post_params )
    if @post.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_product
    @product = Product.find( params[:product_id] )