app/controllers/user_profile_controller.rb

  def show
    @profile = Profile.find_by(user_id: @user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 1]]

  def edit
    @profile = Profile.find_by(user_id: @user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 1]]

  def update
    @profile = Profile.find_by(user_id: @user.id)
    unless permitted(@profile)
      redirect_to profile_path( @user )
      return
    end
    if @profile.update( profile_params )
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 1]]
UPDATE "profiles" SET "image" = ? WHERE "profiles"."id" = ?  [["image", "10421378_10202242809029958_2337388105527706665_n.jpg"], ["id", 1]]