app/controllers/user_products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def show
    @product = Product.find( params[:id] )

INSERT INTO "products" ("title", "image", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "M9"], ["image", "images_templerun.jpeg"], ["description", "123"], ["user_id", 1], ["created_at", "2015-08-08 06:42:00.938437"], ["updated_at", "2015-08-08 06:42:00.938437"]]
---
  def create
    @product = @user.products.build( product_params )
    unless permitted(@product)
      redirect_to products_path( @user )
      return
    end
    if @product.save && @product.update_category(params[:product][:category_ids])

SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
  def edit
    @product = Product.find( params[:id] )

SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "images_templerun.jpeg"], ["updated_at", "2015-08-08 14:40:52.114260"], ["id", 1]]
---
  def update
    @product = Product.find( params[:id] )
    unless permitted(@product)
      redirect_to products_path( @user )
      return
    end
    if @product.update( product_params ) && @product.update_category(params[:product][:category_ids])