app/controllers/user_collections_controller.rb

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 8]]
---
  def show
    @collection = Collection.find_by(id: params[:id])

INSERT INTO "collections" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "uuuu"], ["user_id", nil], ["created_at", "2015-08-21 16:49:33.857262"], ["updated_at", "2015-08-21 16:49:33.857262"]]
---
  def create
    @collection = Collection.new(collection_params)
    @collection.user_id = @user.id
    unless permitted(@collection)
      redirect_to collections_path
      return
    end
    if @collection.save

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 7]]
---
  def edit
    @collection = Collection.find_by(id: params[:id])

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 7]]
---
  def update
    @collection = Collection.find_by(id: params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = 1
---
  def index
    @collection = Collection.where(user_id: @user)

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 7]]
---
  def destroy
    @collection = Collection.find_by(id: params[:id])
    unless permitted(@collection)
      redirect_to collections_path
      return
    end
    @collection.destroy