app/views/common/_navbar.html.erb

SELECT "products".* FROM "products"
---
      <ul class="nav navbar-nav">
      <% Product.category_list.each do |category| %>